; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain satellite)
    (:requirements :typing)
    (:types
        satellite - object
        direction - object
        instrument - object
        mode - object
        object
    )

    (:constants
        
    )

    (:predicates
        (pointing ?x1 - satellite ?x2 - direction)
        (supports ?x1 - instrument ?x2 - mode)
        (calibration_target ?x1 - instrument ?x2 - direction)
        (calibrated ?x1 - instrument)
        (power_on ?x1 - instrument)
        (have_image ?x1 - direction ?x2 - mode)
        (on_board ?x1 - instrument ?x2 - satellite)
        (power_avail ?x1 - satellite)
    )

    (:functions
        
    )

    

    
    (:action turn_to_1
     :parameters (?x0 - satellite ?x1 - direction ?x2 - direction)
     :precondition (pointing ?x0 ?x2)
     :effect (and
        (pointing ?x0 ?x1)
        (not (pointing ?x0 ?x2)))
    )


    (:action switch_off_1
     :parameters (?x0 - instrument ?x1 - satellite)
     :precondition (and (on_board ?x0 ?x1) (calibrated ?x0) (power_on ?x0))
     :effect (and
        (power_avail ?x1)
        (not (power_on ?x0)))
    )


    (:action calibrate_1
     :parameters (?x0 - satellite ?x1 - instrument ?x2 - direction)
     :precondition (and (power_on ?x1) (pointing ?x0 ?x2) (on_board ?x1 ?x0) (calibration_target ?x1 ?x2))
     :effect (and
        (calibrated ?x1))
    )


    (:action switch_on_1
     :parameters (?x0 - instrument ?x1 - satellite)
     :precondition (and (on_board ?x0 ?x1) (power_avail ?x1))
     :effect (and
        (power_on ?x0)
        (not (power_avail ?x1)))
    )


    (:action take_image_1
     :parameters (?x0 - satellite ?x1 - direction ?x2 - instrument ?x3 - mode)
     :precondition (and (on_board ?x2 ?x0) (pointing ?x0 ?x1) (calibrated ?x2) (power_on ?x2) (supports ?x2 ?x3))
     :effect (and
        (have_image ?x1 ?x3))
    )

)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite1 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite4 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	thermograph2 - mode
	thermograph3 - mode
	thermograph4 - mode
	thermograph0 - mode
	infrared5 - mode
	image6 - mode
	thermograph7 - mode
	image1 - mode
	groundstation1 - direction
	star0 - direction
	groundstation3 - direction
	groundstation4 - direction
	groundstation2 - direction
	planet5 - direction
	planet6 - direction
	phenomenon7 - direction
	phenomenon8 - direction
	star9 - direction
	star10 - direction
	star11 - direction
	star12 - direction
	planet13 - direction
	phenomenon14 - direction
	planet15 - direction
	planet16 - direction
	phenomenon17 - direction
	planet18 - direction
	phenomenon19 - direction
	planet20 - direction
	phenomenon21 - direction
	star22 - direction
	planet23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image6)
	(calibration_target instrument0 groundstation1)
	(supports instrument1 image6)
	(calibration_target instrument1 groundstation4)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 groundstation1)
	(supports instrument3 thermograph7)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 groundstation3)
	(supports instrument4 image1)
	(calibration_target instrument4 groundstation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet16)
	(supports instrument5 infrared5)
	(calibration_target instrument5 groundstation1)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 groundstation1)
	(supports instrument7 thermograph7)
	(calibration_target instrument7 groundstation1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation1)
	(supports instrument8 thermograph3)
	(supports instrument8 infrared5)
	(calibration_target instrument8 star0)
	(supports instrument9 image6)
	(calibration_target instrument9 groundstation3)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 star0)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon17)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 star0)
	(supports instrument12 infrared5)
	(supports instrument12 thermograph7)
	(calibration_target instrument12 groundstation4)
	(supports instrument13 thermograph4)
	(calibration_target instrument13 groundstation3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(on_board instrument13 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon19)
	(supports instrument14 infrared5)
	(calibration_target instrument14 groundstation4)
	(supports instrument15 infrared5)
	(calibration_target instrument15 groundstation2)
	(supports instrument16 infrared5)
	(calibration_target instrument16 groundstation4)
	(supports instrument17 infrared5)
	(supports instrument17 thermograph0)
	(supports instrument17 image6)
	(calibration_target instrument17 groundstation4)
	(supports instrument18 image1)
	(supports instrument18 thermograph7)
	(supports instrument18 image6)
	(calibration_target instrument18 groundstation2)
	(on_board instrument14 satellite4)
	(on_board instrument15 satellite4)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(on_board instrument18 satellite4)
	(power_avail satellite4)
	(pointing satellite4 groundstation3)
)
(:goal (and
	(pointing satellite3 star12)
	(pointing satellite4 groundstation1)
	(have_image planet5 image6)
	(have_image planet6 thermograph4)
	(have_image planet6 thermograph0)
	(have_image phenomenon8 thermograph0)
	(have_image phenomenon8 thermograph7)
	(have_image star9 image1)
	(have_image star10 infrared5)
	(have_image star10 image1)
	(have_image star11 infrared5)
	(have_image star11 thermograph3)
	(have_image star12 infrared5)
	(have_image planet13 thermograph3)
	(have_image phenomenon14 thermograph0)
	(have_image phenomenon14 image6)
	(have_image planet15 image1)
	(have_image planet16 image1)
	(have_image phenomenon17 infrared5)
	(have_image phenomenon17 thermograph7)
	(have_image planet18 image1)
	(have_image planet18 infrared5)
	(have_image planet20 thermograph7)
	(have_image phenomenon21 thermograph7)
	(have_image star22 thermograph4)
	(have_image star22 thermograph7)
	(have_image planet23 infrared5)
	(have_image phenomenon24 thermograph4)
	(have_image phenomenon24 thermograph2)
))

)

; plan
1. (turn_to_1 satellite4 groundstation1 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 groundstation1)
   goals met: 1 of 29
2. (turn_to_1 satellite3 star12 phenomenon19)
   deleted: (pointing satellite3 phenomenon19)
   added: (pointing satellite3 star12)
   goals met: 2 of 29
3. (turn_to_1 satellite2 phenomenon14 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 29
4. (turn_to_1 satellite1 phenomenon17 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 29
5. (turn_to_1 satellite0 groundstation1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 29
6. (turn_to_1 satellite2 star0 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star0)
   goals met: 2 of 29
7. (switch_on_1 instrument10 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument10)
   goals met: 2 of 29
8. (calibrate_1 satellite2 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 2 of 29
9. (turn_to_1 satellite2 phenomenon14 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 29
10. (take_image_1 satellite2 phenomenon14 instrument10 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 3 of 29
11. (turn_to_1 satellite2 phenomenon8 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon8)
   goals met: 3 of 29
12. (take_image_1 satellite2 phenomenon8 instrument10 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 4 of 29
13. (turn_to_1 satellite2 planet15 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet15)
   goals met: 4 of 29
14. (take_image_1 satellite2 planet15 instrument10 image1)
   added: (have_image planet15 image1)
   goals met: 5 of 29
15. (turn_to_1 satellite2 planet18 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet18)
   goals met: 5 of 29
16. (take_image_1 satellite2 planet18 instrument10 image1)
   added: (have_image planet18 image1)
   goals met: 6 of 29
17. (turn_to_1 satellite1 groundstation1 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation1)
   goals met: 6 of 29
18. (turn_to_1 satellite2 planet16 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet16)
   goals met: 6 of 29
19. (take_image_1 satellite2 planet16 instrument10 image1)
   added: (have_image planet16 image1)
   goals met: 7 of 29
20. (turn_to_1 satellite2 planet6 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet6)
   goals met: 7 of 29
21. (take_image_1 satellite2 planet6 instrument10 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 8 of 29
22. (turn_to_1 satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   goals met: 8 of 29
23. (take_image_1 satellite2 star10 instrument10 image1)
   added: (have_image star10 image1)
   goals met: 9 of 29
24. (turn_to_1 satellite2 star9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star9)
   goals met: 9 of 29
25. (take_image_1 satellite2 star9 instrument10 image1)
   added: (have_image star9 image1)
   goals met: 10 of 29
26. (switch_on_1 instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 10 of 29
27. (calibrate_1 satellite1 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 10 of 29
28. (turn_to_1 satellite1 planet13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet13)
   goals met: 10 of 29
29. (take_image_1 satellite1 planet13 instrument6 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 11 of 29
30. (turn_to_1 satellite1 star11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star11)
   goals met: 11 of 29
31. (take_image_1 satellite1 star11 instrument6 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 12 of 29
32. (switch_on_1 instrument12 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument12)
   goals met: 12 of 29
33. (turn_to_1 satellite3 groundstation4 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 groundstation4)
   goals met: 11 of 29
34. (calibrate_1 satellite3 instrument12 groundstation4)
   added: (calibrated instrument12)
   goals met: 11 of 29
35. (turn_to_1 satellite3 phenomenon17 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon17)
   goals met: 11 of 29
36. (take_image_1 satellite3 phenomenon17 instrument12 infrared5)
   added: (have_image phenomenon17 infrared5)
   goals met: 12 of 29
37. (take_image_1 satellite3 phenomenon17 instrument12 thermograph7)
   added: (have_image phenomenon17 thermograph7)
   goals met: 13 of 29
38. (turn_to_1 satellite3 phenomenon21 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon21)
   goals met: 13 of 29
39. (take_image_1 satellite3 phenomenon21 instrument12 thermograph7)
   added: (have_image phenomenon21 thermograph7)
   goals met: 14 of 29
40. (turn_to_1 satellite3 phenomenon8 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon8)
   goals met: 14 of 29
41. (take_image_1 satellite3 phenomenon8 instrument12 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 15 of 29
42. (turn_to_1 satellite3 planet18 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet18)
   goals met: 15 of 29
43. (take_image_1 satellite3 planet18 instrument12 infrared5)
   added: (have_image planet18 infrared5)
   goals met: 16 of 29
44. (turn_to_1 satellite3 planet20 planet18)
   deleted: (pointing satellite3 planet18)
   added: (pointing satellite3 planet20)
   goals met: 16 of 29
45. (take_image_1 satellite3 planet20 instrument12 thermograph7)
   added: (have_image planet20 thermograph7)
   goals met: 17 of 29
46. (turn_to_1 satellite3 planet23 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet23)
   goals met: 17 of 29
47. (take_image_1 satellite3 planet23 instrument12 infrared5)
   added: (have_image planet23 infrared5)
   goals met: 18 of 29
48. (turn_to_1 satellite3 star10 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 star10)
   goals met: 18 of 29
49. (take_image_1 satellite3 star10 instrument12 infrared5)
   added: (have_image star10 infrared5)
   goals met: 19 of 29
50. (turn_to_1 satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 19 of 29
51. (take_image_1 satellite3 star11 instrument12 infrared5)
   added: (have_image star11 infrared5)
   goals met: 20 of 29
52. (turn_to_1 satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 21 of 29
53. (take_image_1 satellite3 star12 instrument12 infrared5)
   added: (have_image star12 infrared5)
   goals met: 22 of 29
54. (switch_on_1 instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 22 of 29
55. (calibrate_1 satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 22 of 29
56. (turn_to_1 satellite0 phenomenon24 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon24)
   goals met: 22 of 29
57. (turn_to_1 satellite0 star22 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 star22)
   goals met: 22 of 29
58. (take_image_1 satellite0 star22 instrument2 thermograph4)
   added: (have_image star22 thermograph4)
   goals met: 23 of 29
59. (take_image_1 satellite0 star22 instrument2 thermograph7)
   added: (have_image star22 thermograph7)
   goals met: 24 of 29
60. (turn_to_1 satellite0 phenomenon24 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 phenomenon24)
   goals met: 24 of 29
61. (take_image_1 satellite0 phenomenon24 instrument2 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 25 of 29
62. (take_image_1 satellite0 phenomenon24 instrument2 thermograph4)
   added: (have_image phenomenon24 thermograph4)
   goals met: 26 of 29
63. (turn_to_1 satellite0 planet6 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 planet6)
   goals met: 26 of 29
64. (take_image_1 satellite0 planet6 instrument2 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 27 of 29
65. (switch_on_1 instrument17 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument17)
   goals met: 27 of 29
66. (turn_to_1 satellite4 groundstation4 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation4)
   goals met: 26 of 29
67. (calibrate_1 satellite4 instrument17 groundstation4)
   added: (calibrated instrument17)
   goals met: 26 of 29
68. (turn_to_1 satellite4 groundstation1 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 groundstation1)
   goals met: 27 of 29
69. (turn_to_1 satellite4 phenomenon14 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon14)
   goals met: 26 of 29
70. (take_image_1 satellite4 phenomenon14 instrument17 image6)
   added: (have_image phenomenon14 image6)
   goals met: 27 of 29
71. (turn_to_1 satellite4 groundstation1 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 groundstation1)
   goals met: 28 of 29
72. (turn_to_1 satellite4 planet5 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet5)
   goals met: 27 of 29
73. (take_image_1 satellite4 planet5 instrument17 image6)
   added: (have_image planet5 image6)
   goals met: 28 of 29
74. (turn_to_1 satellite4 groundstation1 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 groundstation1)
   goals met: 29 of 29
